<?xml version="1.0"?>
<net name="main_graph" version="11">
	<layers>
		<layer id="8" name="tgt" type="Parameter" version="opset1">
			<data shape="?,?" element_type="i64" />
			<rt_info>
				<attribute name="old_api_map_element_type" version="0" value="i32" />
			</rt_info>
			<output>
				<port id="0" precision="I64" names="tgt">
					<dim>-1</dim>
					<dim>-1</dim>
				</port>
			</output>
		</layer>
		<layer id="7" name="tgt_mask" type="Parameter" version="opset1">
			<data shape="?,?,?" element_type="boolean" />
			<output>
				<port id="0" precision="BOOL" names="tgt_mask">
					<dim>-1</dim>
					<dim>-1</dim>
					<dim>-1</dim>
				</port>
			</output>
		</layer>
		<layer id="6" name="memory" type="Parameter" version="opset1">
			<data shape="?,?,768" element_type="f32" />
			<output>
				<port id="0" precision="FP32" names="memory">
					<dim>-1</dim>
					<dim>-1</dim>
					<dim>768</dim>
				</port>
			</output>
		</layer>
		<layer id="5" name="cache_in_0" type="Parameter" version="opset1">
			<data shape="?,?,768" element_type="f32" />
			<output>
				<port id="0" precision="FP32" names="cache_in_0">
					<dim>-1</dim>
					<dim>-1</dim>
					<dim>768</dim>
				</port>
			</output>
		</layer>
		<layer id="4" name="cache_in_1" type="Parameter" version="opset1">
			<data shape="?,?,768" element_type="f32" />
			<output>
				<port id="0" precision="FP32" names="cache_in_1">
					<dim>-1</dim>
					<dim>-1</dim>
					<dim>768</dim>
				</port>
			</output>
		</layer>
		<layer id="3" name="cache_in_2" type="Parameter" version="opset1">
			<data shape="?,?,768" element_type="f32" />
			<output>
				<port id="0" precision="FP32" names="cache_in_2">
					<dim>-1</dim>
					<dim>-1</dim>
					<dim>768</dim>
				</port>
			</output>
		</layer>
		<layer id="2" name="cache_in_3" type="Parameter" version="opset1">
			<data shape="?,?,768" element_type="f32" />
			<output>
				<port id="0" precision="FP32" names="cache_in_3">
					<dim>-1</dim>
					<dim>-1</dim>
					<dim>768</dim>
				</port>
			</output>
		</layer>
		<layer id="1" name="cache_in_4" type="Parameter" version="opset1">
			<data shape="?,?,768" element_type="f32" />
			<output>
				<port id="0" precision="FP32" names="cache_in_4">
					<dim>-1</dim>
					<dim>-1</dim>
					<dim>768</dim>
				</port>
			</output>
		</layer>
		<layer id="0" name="cache_in_5" type="Parameter" version="opset1">
			<data shape="?,?,768" element_type="f32" />
			<output>
				<port id="0" precision="FP32" names="cache_in_5">
					<dim>-1</dim>
					<dim>-1</dim>
					<dim>768</dim>
				</port>
			</output>
		</layer>
		<layer id="9" name="Constant_1468727" type="Const" version="opset1">
			<data element_type="i8" shape="5049, 768" offset="0" size="3877632" />
			<output>
				<port id="0" precision="I8">
					<dim>5049</dim>
					<dim>768</dim>
				</port>
			</output>
		</layer>
		<layer id="10" name="Convert_1468728" type="Convert" version="opset1">
			<data destination_type="f32" />
			<input>
				<port id="0" precision="I8">
					<dim>5049</dim>
					<dim>768</dim>
				</port>
			</input>
			<output>
				<port id="1" precision="FP32">
					<dim>5049</dim>
					<dim>768</dim>
				</port>
			</output>
		</layer>
		<layer id="11" name="Constant_1468729" type="Const" version="opset1">
			<data element_type="f32" shape="5049, 1" offset="3877632" size="20196" />
			<output>
				<port id="0" precision="FP32">
					<dim>5049</dim>
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="12" name="/embed/embed.0/Gather/fq_weights_0" type="Multiply" version="opset1">
			<data auto_broadcast="numpy" />
			<input>
				<port id="0" precision="FP32">
					<dim>5049</dim>
					<dim>768</dim>
				</port>
				<port id="1" precision="FP32">
					<dim>5049</dim>
					<dim>1</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP32">
					<dim>5049</dim>
					<dim>768</dim>
				</port>
			</output>
		</layer>
		<layer id="13" name="Constant_41481" type="Const" version="opset1">
			<data element_type="i64" shape="" offset="3897828" size="8" />
			<output>
				<port id="0" precision="I64" />
			</output>
		</layer>
		<layer id="14" name="/embed/embed.0/Gather" type="Gather" version="opset8">
			<data batch_dims="0" />
			<input>
				<port id="0" precision="FP32">
					<dim>5049</dim>
					<dim>768</dim>
				</port>
				<port id="1" precision="I64">
					<dim>-1</dim>
					<dim>-1</dim>
				</port>
				<port id="2" precision="I64" />
			</input>
			<output>
				<port id="3" precision="FP32" names="/embed/embed.0/Gather_output_0">
					<dim>-1</dim>
					<dim>-1</dim>
					<dim>768</dim>
				</port>
			</output>
		</layer>
		<layer id="15" name="Constant_45617_compressed" type="Const" version="opset1">
			<data element_type="f16" shape="1, 1, 1" offset="3897836" size="2" />
			<output>
				<port id="0" precision="FP16">
					<dim>1</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="16" name="Constant_45617" type="Convert" version="opset1">
			<data destination_type="f32" />
			<rt_info>
				<attribute name="decompression" version="0" />
			</rt_info>
			<input>
				<port id="0" precision="FP16">
					<dim>1</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</input>
			<output>
				<port id="1" precision="FP32">
					<dim>1</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="17" name="/embed/embed.1/Mul" type="Multiply" version="opset1">
			<data auto_broadcast="numpy" />
			<input>
				<port id="0" precision="FP32">
					<dim>-1</dim>
					<dim>-1</dim>
					<dim>768</dim>
				</port>
				<port id="1" precision="FP32">
					<dim>1</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP32" names="/embed/embed.1/Mul_output_0">
					<dim>-1</dim>
					<dim>-1</dim>
					<dim>768</dim>
				</port>
			</output>
		</layer>
		<layer id="18" name="Constant_285_compressed" type="Const" version="opset1">
			<data element_type="f16" shape="1, 5000, 768" offset="3897838" size="7680000" />
			<output>
				<port id="0" precision="FP16" names="onnx::Slice_178">
					<dim>1</dim>
					<dim>5000</dim>
					<dim>768</dim>
				</port>
			</output>
		</layer>
		<layer id="19" name="Constant_285" type="Convert" version="opset1">
			<data destination_type="f32" />
			<rt_info>
				<attribute name="decompression" version="0" />
			</rt_info>
			<input>
				<port id="0" precision="FP16">
					<dim>1</dim>
					<dim>5000</dim>
					<dim>768</dim>
				</port>
			</input>
			<output>
				<port id="1" precision="FP32">
					<dim>1</dim>
					<dim>5000</dim>
					<dim>768</dim>
				</port>
			</output>
		</layer>
		<layer id="20" name="Constant_44275" type="Const" version="opset1">
			<data element_type="i64" shape="2" offset="11577838" size="16" />
			<rt_info>
				<attribute name="precise" version="0" />
			</rt_info>
			<output>
				<port id="0" precision="I64">
					<dim>2</dim>
				</port>
			</output>
		</layer>
		<layer id="21" name="Constant_44276" type="Const" version="opset1">
			<data element_type="i64" shape="2" offset="11577838" size="16" />
			<rt_info>
				<attribute name="precise" version="0" />
			</rt_info>
			<output>
				<port id="0" precision="I64">
					<dim>2</dim>
				</port>
			</output>
		</layer>
		<layer id="22" name="Constant_44272" type="Const" version="opset1">
			<data element_type="i64" shape="1" offset="11577854" size="8" />
			<rt_info>
				<attribute name="precise" version="0" />
			</rt_info>
			<output>
				<port id="0" precision="I64">
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="23" name="/embed/embed.1/Shape" type="ShapeOf" version="opset3">
			<data output_type="i64" />
			<input>
				<port id="0" precision="FP32">
					<dim>-1</dim>
					<dim>-1</dim>
					<dim>768</dim>
				</port>
			</input>
			<output>
				<port id="1" precision="I64" names="/embed/embed.1/Shape_output_0">
					<dim>3</dim>
				</port>
			</output>
		</layer>
		<layer id="24" name="Constant_44197" type="Const" version="opset1">
			<data element_type="i64" shape="1" offset="11577854" size="8" />
			<rt_info>
				<attribute name="precise" version="0" />
			</rt_info>
			<output>
				<port id="0" precision="I64">
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="25" name="Constant_41487" type="Const" version="opset1">
			<data element_type="i64" shape="" offset="3897828" size="8" />
			<rt_info>
				<attribute name="precise" version="0" />
			</rt_info>
			<output>
				<port id="0" precision="I64" />
			</output>
		</layer>
		<layer id="26" name="/embed/embed.1/Gather" type="Gather" version="opset8">
			<data batch_dims="0" />
			<input>
				<port id="0" precision="I64">
					<dim>3</dim>
				</port>
				<port id="1" precision="I64">
					<dim>1</dim>
				</port>
				<port id="2" precision="I64" />
			</input>
			<output>
				<port id="3" precision="I64" names="/embed/embed.1/Gather_output_0,/embed/embed.1/Unsqueeze_output_0">
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="27" name="Constant_44271" type="Const" version="opset1">
			<data element_type="i32" shape="1" offset="11577862" size="4" />
			<rt_info>
				<attribute name="precise" version="0" />
			</rt_info>
			<output>
				<port id="0" precision="I32">
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="28" name="ScatterUpdate_44277" type="ScatterUpdate" version="opset3">
			<input>
				<port id="0" precision="I64">
					<dim>2</dim>
				</port>
				<port id="1" precision="I64">
					<dim>1</dim>
				</port>
				<port id="2" precision="I64">
					<dim>1</dim>
				</port>
				<port id="3" precision="I32">
					<dim>1</dim>
				</port>
			</input>
			<output>
				<port id="4" precision="I64">
					<dim>2</dim>
				</port>
			</output>
		</layer>
		<layer id="29" name="Constant_44280" type="Const" version="opset1">
			<data element_type="i64" shape="2" offset="11577866" size="16" />
			<rt_info>
				<attribute name="precise" version="0" />
			</rt_info>
			<output>
				<port id="0" precision="I64">
					<dim>2</dim>
				</port>
			</output>
		</layer>
		<layer id="30" name="/embed/embed.1/Slice" type="StridedSlice" version="opset1">
			<data begin_mask="1, 0" end_mask="1, 0" new_axis_mask="" shrink_axis_mask="" ellipsis_mask="" />
			<input>
				<port id="0" precision="FP32">
					<dim>1</dim>
					<dim>5000</dim>
					<dim>768</dim>
				</port>
				<port id="1" precision="I64">
					<dim>2</dim>
				</port>
				<port id="2" precision="I64">
					<dim>2</dim>
				</port>
				<port id="3" precision="I64">
					<dim>2</dim>
				</port>
			</input>
			<output>
				<port id="4" precision="FP32" names="/embed/embed.1/Slice_output_0">
					<dim>1</dim>
					<dim>-1</dim>
					<dim>768</dim>
				</port>
			</output>
		</layer>
		<layer id="31" name="/embed/embed.1/Add" type="Add" version="opset1">
			<data auto_broadcast="numpy" />
			<input>
				<port id="0" precision="FP32">
					<dim>-1</dim>
					<dim>-1</dim>
					<dim>768</dim>
				</port>
				<port id="1" precision="FP32">
					<dim>1</dim>
					<dim>-1</dim>
					<dim>768</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP32" names="/embed/embed.1/Add_output_0">
					<dim>-1</dim>
					<dim>-1</dim>
					<dim>768</dim>
				</port>
			</output>
		</layer>
		<layer id="32" name="Constant_44287" type="Const" version="opset1">
			<data element_type="i64" shape="2" offset="11577882" size="16" />
			<rt_info>
				<attribute name="precise" version="0" />
			</rt_info>
			<output>
				<port id="0" precision="I64">
					<dim>2</dim>
				</port>
			</output>
		</layer>
		<layer id="33" name="Constant_44290" type="Const" version="opset1">
			<data element_type="i64" shape="2" offset="11577898" size="16" />
			<rt_info>
				<attribute name="precise" version="0" />
			</rt_info>
			<output>
				<port id="0" precision="I64">
					<dim>2</dim>
				</port>
			</output>
		</layer>
		<layer id="34" name="Constant_44293" type="Const" version="opset1">
			<data element_type="i64" shape="2" offset="11577866" size="16" />
			<rt_info>
				<attribute name="precise" version="0" />
			</rt_info>
			<output>
				<port id="0" precision="I64">
					<dim>2</dim>
				</port>
			</output>
		</layer>
		<layer id="35" name="/decoders.0/Slice_1" type="StridedSlice" version="opset1">
			<data begin_mask="1, 0" end_mask="1, 0" new_axis_mask="" shrink_axis_mask="" ellipsis_mask="" />
			<input>
				<port id="0" precision="FP32">
					<dim>-1</dim>
					<dim>-1</dim>
					<dim>768</dim>
				</port>
				<port id="1" precision="I64">
					<dim>2</dim>
				</port>
				<port id="2" precision="I64">
					<dim>2</dim>
				</port>
				<port id="3" precision="I64">
					<dim>2</dim>
				</port>
			</input>
			<output>
				<port id="4" precision="FP32" names="/decoders.0/Slice_1_output_0">
					<dim>-1</dim>
					<dim>-1</dim>
					<dim>768</dim>
				</port>
			</output>
		</layer>
		<layer id="36" name="Constant_45625_compressed" type="Const" version="opset1">
			<data element_type="f16" shape="1, 1, 768" offset="11577914" size="1536" />
			<output>
				<port id="0" precision="FP16">
					<dim>1</dim>
					<dim>1</dim>
					<dim>768</dim>
				</port>
			</output>
		</layer>
		<layer id="37" name="Constant_45625" type="Convert" version="opset1">
			<data destination_type="f32" />
			<rt_info>
				<attribute name="decompression" version="0" />
			</rt_info>
			<input>
				<port id="0" precision="FP16">
					<dim>1</dim>
					<dim>1</dim>
					<dim>768</dim>
				</port>
			</input>
			<output>
				<port id="1" precision="FP32">
					<dim>1</dim>
					<dim>1</dim>
					<dim>768</dim>
				</port>
			</output>
		</layer>
		<layer id="38" name="Constant_44299" type="Const" version="opset1">
			<data element_type="i64" shape="2" offset="11577882" size="16" />
			<rt_info>
				<attribute name="precise" version="0" />
			</rt_info>
			<output>
				<port id="0" precision="I64">
					<dim>2</dim>
				</port>
			</output>
		</layer>
		<layer id="39" name="Constant_44302" type="Const" version="opset1">
			<data element_type="i64" shape="2" offset="11577898" size="16" />
			<rt_info>
				<attribute name="precise" version="0" />
			</rt_info>
			<output>
				<port id="0" precision="I64">
					<dim>2</dim>
				</port>
			</output>
		</layer>
		<layer id="40" name="Constant_44305" type="Const" version="opset1">
			<data element_type="i64" shape="2" offset="11577866" size="16" />
			<rt_info>
				<attribute name="precise" version="0" />
			</rt_info>
			<output>
				<port id="0" precision="I64">
					<dim>2</dim>
				</port>
			</output>
		</layer>
		<layer id="41" name="/decoders.0/Slice_2" type="StridedSlice" version="opset1">
			<data begin_mask="1, 0" end_mask="1, 0" new_axis_mask="" shrink_axis_mask="" ellipsis_mask="" />
			<input>
				<port id="0" precision="BOOL">
					<dim>-1</dim>
					<dim>-1</dim>
					<dim>-1</dim>
				</port>
				<port id="1" precision="I64">
					<dim>2</dim>
				</port>
				<port id="2" precision="I64">
					<dim>2</dim>
				</port>
				<port id="3" precision="I64">
					<dim>2</dim>
				</port>
			</input>
			<output>
				<port id="4" precision="BOOL" names="/decoders.0/Slice_2_output_0">
					<dim>-1</dim>
					<dim>-1</dim>
					<dim>-1</dim>
				</port>
			</output>
		</layer>
		<layer id="42" name="Constant_41573" type="Const" version="opset1">
			<data element_type="i64" shape="1" offset="11577854" size="8" />
			<output>
				<port id="0" precision="I64">
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="43" name="/decoders.0/self_attn/Unsqueeze_3" type="Unsqueeze" version="opset1">
			<input>
				<port id="0" precision="BOOL">
					<dim>-1</dim>
					<dim>-1</dim>
					<dim>-1</dim>
				</port>
				<port id="1" precision="I64">
					<dim>1</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="BOOL" names="/decoders.0/self_attn/Unsqueeze_3_output_0">
					<dim>-1</dim>
					<dim>1</dim>
					<dim>-1</dim>
					<dim>-1</dim>
				</port>
			</output>
		</layer>
		<layer id="44" name="/decoders.0/self_attn/Cast" type="Convert" version="opset1">
			<data destination_type="i64" />
			<input>
				<port id="0" precision="BOOL">
					<dim>-1</dim>
					<dim>1</dim>
					<dim>-1</dim>
					<dim>-1</dim>
				</port>
			</input>
			<output>
				<port id="1" precision="I64" names="/decoders.0/self_attn/Cast_output_0">
					<dim>-1</dim>
					<dim>1</dim>
					<dim>-1</dim>
					<dim>-1</dim>
				</port>
			</output>
		</layer>
		<layer id="45" name="Constant_45618" type="Const" version="opset1">
			<data element_type="i64" shape="1, 1, 1, 1" offset="3897828" size="8" />
			<output>
				<port id="0" precision="I64">
					<dim>1</dim>
					<dim>1</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="46" name="/decoders.0/self_attn/Equal" type="Equal" version="opset1">
			<data auto_broadcast="numpy" />
			<input>
				<port id="0" precision="I64">
					<dim>-1</dim>
					<dim>1</dim>
					<dim>-1</dim>
					<dim>-1</dim>
				</port>
				<port id="1" precision="I64">
					<dim>1</dim>
					<dim>1</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="BOOL" names="/decoders.0/self_attn/Cast_1_output_0,/decoders.0/self_attn/Cast_2_output_0,/decoders.0/self_attn/Equal_output_0,/decoders.1/self_attn/Cast_1_output_0,/decoders.1/self_attn/Cast_output_0,/decoders.2/self_attn/Cast_1_output_0,/decoders.2/self_attn/Cast_output_0,/decoders.3/self_attn/Cast_1_output_0,/decoders.3/self_attn/Cast_output_0,/decoders.4/self_attn/Cast_1_output_0,/decoders.4/self_attn/Cast_output_0,/decoders.5/self_attn/Cast_1_output_0,/decoders.5/self_attn/Cast_output_0">
					<dim>-1</dim>
					<dim>1</dim>
					<dim>-1</dim>
					<dim>-1</dim>
				</port>
			</output>
		</layer>
		<layer id="47" name="/decoders.0/self_attn/Constant_14_compressed" type="Const" version="opset1">
			<data element_type="f16" shape="" offset="11579450" size="2" />
			<output>
				<port id="0" precision="FP16" names="/decoders.0/self_attn/Constant_14_output_0" />
			</output>
		</layer>
		<layer id="48" name="/decoders.0/self_attn/Constant_14" type="Convert" version="opset1">
			<data destination_type="f32" />
			<rt_info>
				<attribute name="decompression" version="0" />
			</rt_info>
			<input>
				<port id="0" precision="FP16" />
			</input>
			<output>
				<port id="1" precision="FP32" />
			</output>
		</layer>
		<layer id="49" name="/decoders.0/self_attn/Constant_13" type="Const" version="opset1">
			<data element_type="f32" shape="" offset="11579452" size="4" />
			<output>
				<port id="0" precision="FP32" names="/decoders.0/self_attn/Constant_13_output_0" />
			</output>
		</layer>
		<layer id="50" name="Constant_45621_compressed" type="Const" version="opset1">
			<data element_type="f16" shape="1, 1, 768" offset="11579456" size="1536" />
			<output>
				<port id="0" precision="FP16">
					<dim>1</dim>
					<dim>1</dim>
					<dim>768</dim>
				</port>
			</output>
		</layer>
		<layer id="51" name="Constant_45621" type="Convert" version="opset1">
			<data destination_type="f32" />
			<rt_info>
				<attribute name="decompression" version="0" />
			</rt_info>
			<input>
				<port id="0" precision="FP16">
					<dim>1</dim>
					<dim>1</dim>
					<dim>768</dim>
				</port>
			</input>
			<output>
				<port id="1" precision="FP32">
					<dim>1</dim>
					<dim>1</dim>
					<dim>768</dim>
				</port>
			</output>
		</layer>
		<layer id="52" name="Constant_41498" type="Const" version="opset1">
			<data element_type="i64" shape="1" offset="11580992" size="8" />
			<output>
				<port id="0" precision="I64">
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="53" name="/decoders.0/norm1/Div" type="MVN" version="opset6">
			<data eps="9.999999960041972e-13" normalize_variance="true" eps_mode="INSIDE_SQRT" />
			<input>
				<port id="0" precision="FP32">
					<dim>-1</dim>
					<dim>-1</dim>
					<dim>768</dim>
				</port>
				<port id="1" precision="I64">
					<dim>1</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP32" names="/decoders.0/norm1/Div_output_0">
					<dim>-1</dim>
					<dim>-1</dim>
					<dim>768</dim>
				</port>
			</output>
		</layer>
		<layer id="54" name="Constant_45619_compressed" type="Const" version="opset1">
			<data element_type="f16" shape="1, 1, 768" offset="11581000" size="1536" />
			<output>
				<port id="0" precision="FP16">
					<dim>1</dim>
					<dim>1</dim>
					<dim>768</dim>
				</port>
			</output>
		</layer>
		<layer id="55" name="Constant_45619" type="Convert" version="opset1">
			<data destination_type="f32" />
			<rt_info>
				<attribute name="decompression" version="0" />
			</rt_info>
			<input>
				<port id="0" precision="FP16">
					<dim>1</dim>
					<dim>1</dim>
					<dim>768</dim>
				</port>
			</input>
			<output>
				<port id="1" precision="FP32">
					<dim>1</dim>
					<dim>1</dim>
					<dim>768</dim>
				</port>
			</output>
		</layer>
		<layer id="56" name="/decoders.0/norm1/Mul" type="Multiply" version="opset1">
			<data auto_broadcast="numpy" />
			<input>
				<port id="0" precision="FP32">
					<dim>-1</dim>
					<dim>-1</dim>
					<dim>768</dim>
				</port>
				<port id="1" precision="FP32">
					<dim>1</dim>
					<dim>1</dim>
					<dim>768</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP32" names="/decoders.0/norm1/Mul_output_0">
					<dim>-1</dim>
					<dim>-1</dim>
					<dim>768</dim>
				</port>
			</output>
		</layer>
		<layer id="57" name="Constant_45620_compressed" type="Const" version="opset1">
			<data element_type="f16" shape="1, 1, 768" offset="11582536" size="1536" />
			<output>
				<port id="0" precision="FP16">
					<dim>1</dim>
					<dim>1</dim>
					<dim>768</dim>
				</port>
			</output>
		</layer>
		<layer id="58" name="Constant_45620" type="Convert" version="opset1">
			<data destination_type="f32" />
			<rt_info>
				<attribute name="decompression" version="0" />
			</rt_info>
			<input>
				<port id="0" precision="FP16">
					<dim>1</dim>
					<dim>1</dim>
					<dim>768</dim>
				</port>
			</input>
			<output>
				<port id="1" precision="FP32">
					<dim>1</dim>
					<dim>1</dim>
					<dim>768</dim>
				</port>
			</output>
		</layer>
		<layer id="59" name="/decoders.0/norm1/Add_1" type="Add" version="opset1">
			<data auto_broadcast="numpy" />
			<input>
				<port id="0" precision="FP32">
					<dim>-1</dim>
					<dim>-1</dim>
					<dim>768</dim>
				</port>
				<port id="1" precision="FP32">
					<dim>1</dim>
					<dim>1</dim>
					<dim>768</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP32" names="/decoders.0/norm1/Add_1_output_0">
					<dim>-1</dim>
					<dim>-1</dim>
					<dim>768</dim>
				</port>
			</output>
		</layer>
		<layer id="60" name="Constant_44311" type="Const" version="opset1">
			<data element_type="i64" shape="2" offset="11577882" size="16" />
			<rt_info>
				<attribute name="precise" version="0" />
			</rt_info>
			<output>
				<port id="0" precision="I64">
					<dim>2</dim>
				</port>
			</output>
		</layer>
		<layer id="61" name="Constant_44314" type="Const" version="opset1">
			<data element_type="i64" shape="2" offset="11577898" size="16" />
			<rt_info>
				<attribute name="precise" version="0" />
			</rt_info>
			<output>
				<port id="0" precision="I64">
					<dim>2</dim>
				</port>
			</output>
		</layer>
		<layer id="62" name="Constant_44317" type="Const" version="opset1">
			<data element_type="i64" shape="2" offset="11577866" size="16" />
			<rt_info>
				<attribute name="precise" version="0" />
			</rt_info>
			<output>
				<port id="0" precision="I64">
					<dim>2</dim>
				</port>
			</output>
		</layer>
		<layer id="63" name="/decoders.0/Slice" type="StridedSlice" version="opset1">
			<data begin_mask="1, 0" end_mask="1, 0" new_axis_mask="" shrink_axis_mask="" ellipsis_mask="" />
			<input>
				<port id="0" precision="FP32">
					<dim>-1</dim>
					<dim>-1</dim>
					<dim>768</dim>
				</port>
				<port id="1" precision="I64">
					<dim>2</dim>
				</port>
				<port id="2" precision="I64">
					<dim>2</dim>
				</port>
				<port id="3" precision="I64">
					<dim>2</dim>
				</port>
			</input>
			<output>
				<port id="4" precision="FP32" names="/decoders.0/Slice_output_0">
					<dim>-1</dim>
					<dim>-1</dim>
					<dim>768</dim>
				</port>
			</output>
		</layer>
		<layer id="64" name="/decoders.0/Slice_0_0/nncf_smooth_quant/scale" type="Const" version="opset1">
			<data element_type="f32" shape="1, 1, 768" offset="11584072" size="3072" />
			<output>
				<port id="0" precision="FP32">
					<dim>1</dim>
					<dim>1</dim>
					<dim>768</dim>
				</port>
			</output>
		</layer>
		<layer id="65" name="/decoders.0/Slice_0_0/nncf_smooth_quant" type="Multiply" version="opset1">
			<data auto_broadcast="numpy" />
			<input>
				<port id="0" precision="FP32">
					<dim>-1</dim>
					<dim>-1</dim>
					<dim>768</dim>
				</port>
				<port id="1" precision="FP32">
					<dim>1</dim>
					<dim>1</dim>
					<dim>768</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP32">
					<dim>-1</dim>
					<dim>-1</dim>
					<dim>768</dim>
				</port>
			</output>
		</layer>
		<layer id="66" name="/decoders.0/Slice_0_0/nncf_smooth_quant/fq_output_0/input_low" type="Const" version="opset1">
			<data element_type="f32" shape="" offset="11587144" size="4" />
			<output>
				<port id="0" precision="FP32" />
			</output>
		</layer>
		<layer id="67" name="/decoders.0/Slice_0_0/nncf_smooth_quant/fq_output_0/input_high" type="Const" version="opset1">
			<data element_type="f32" shape="" offset="11587148" size="4" />
			<output>
				<port id="0" precision="FP32" />
			</output>
		</layer>
		<layer id="68" name="/decoders.0/Slice_0_0/nncf_smooth_quant/fq_output_0/output_low" type="Const" version="opset1">
			<data element_type="f32" shape="" offset="11587144" size="4" />
			<output>
				<port id="0" precision="FP32" />
			</output>
		</layer>
		<layer id="69" name="/decoders.0/Slice_0_0/nncf_smooth_quant/fq_output_0/output_high" type="Const" version="opset1">
			<data element_type="f32" shape="" offset="11587148" size="4" />
			<output>
				<port id="0" precision="FP32" />
			</output>
		</layer>
		<layer id="70" name="/decoders.0/Slice_0_0/nncf_smooth_quant/fq_output_0" type="FakeQuantize" version="opset1">
			<data levels="256" auto_broadcast="numpy" />
			<input>
				<port id="0" precision="FP32">
					<dim>-1</dim>
					<dim>-1</dim>
					<dim>768</dim>
				</port>
				<port id="1" precision="FP32" />
				<port id="2" precision="FP32" />
				<port id="3" precision="FP32" />
				<port id="4" precision="FP32" />
			</input>
			<output>
				<port id="5" precision="FP32">
					<dim>-1</dim>
					<dim>-1</dim>
					<dim>768</dim>
				</port>
			</output>
		</layer>
		<layer id="71" name="Constant_1468732" type="Const" version="opset1">
			<data element_type="i8" shape="768, 768" offset="11587152" size="589824" />
			<output>
				<port id="0" precision="I8">
					<dim>768</dim>
					<dim>768</dim>
				</port>
			</output>
		</layer>
		<layer id="72" name="Convert_1468733" type="Convert" version="opset1">
			<data destination_type="f32" />
			<input>
				<port id="0" precision="I8">
					<dim>768</dim>
					<dim>768</dim>
				</port>
			</input>
			<output>
				<port id="1" precision="FP32">
					<dim>768</dim>
					<dim>768</dim>
				</port>
			</output>
		</layer>
		<layer id="73" name="Constant_1468734" type="Const" version="opset1">
			<data element_type="f32" shape="768, 1" offset="12176976" size="3072" />
			<output>
				<port id="0" precision="FP32">
					<dim>768</dim>
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="74" name="/decoders.0/self_attn/linear_q/MatMul/fq_weights_1" type="Multiply" version="opset1">
			<data auto_broadcast="numpy" />
			<input>
				<port id="0" precision="FP32">
					<dim>768</dim>
					<dim>768</dim>
				</port>
				<port id="1" precision="FP32">
					<dim>768</dim>
					<dim>1</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP32">
					<dim>768</dim>
					<dim>768</dim>
				</port>
			</output>
		</layer>
		<layer id="75" name="/decoders.0/self_attn/linear_q/MatMul" type="MatMul" version="opset1">
			<data transpose_a="false" transpose_b="true" />
			<input>
				<port id="0" precision="FP32">
					<dim>-1</dim>
					<dim>-1</dim>
					<dim>768</dim>
				</port>
				<port id="1" precision="FP32">
					<dim>768</dim>
					<dim>768</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP32" names="/decoders.0/self_attn/linear_q/MatMul_output_0">
					<dim>-1</dim>
					<dim>-1</dim>
					<dim>768</dim>
				</port>
			</output>
		</layer>
		<layer id="76" name="/decoders.0/self_attn/linear_q/Add" type="Add" version="opset1">
			<data auto_broadcast="numpy" />
			<input>
				<port id="0" precision="FP32">
					<dim>1</dim>
					<dim>1</dim>
					<dim>768</dim>
				</port>
				<port id="1" precision="FP32">
					<dim>-1</dim>
					<dim>-1</dim>
					<dim>768</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP32" names="/decoders.0/self_attn/linear_q/Add_output_0">
					<dim>-1</dim>
					<dim>-1</dim>
					<dim>768</dim>
				</port>
			</output>
		</layer>
		<layer id="77" name="/decoders.0/self_attn/linear_q/Add/fq_output_0/input_low" type="Const" version="opset1">
			<data element_type="f32" shape="" offset="12180048" size="4" />
			<output>
				<port id="0" precision="FP32" />
			</output>
		</layer>
		<layer id="78" name="/decoders.0/self_attn/linear_q/Add/fq_output_0/input_high" type="Const" version="opset1">
			<data element_type="f32" shape="" offset="12180052" size="4" />
			<output>
				<port id="0" precision="FP32" />
			</output>
		</layer>
		<layer id="79" name="/decoders.0/self_attn/linear_q/Add/fq_output_0/output_low" type="Const" version="opset1">
			<data element_type="f32" shape="" offset="12180048" size="4" />
			<output>
				<port id="0" precision="FP32" />
			</output>
		</layer>
		<layer id="80" name="/decoders.0/self_attn/linear_q/Add/fq_output_0/output_high" type="Const" version="opset1">
			<data element_type="f32" shape="" offset="12180052" size="4" />
			<output>
				<port id="0" precision="FP32" />
			</output>
		</layer>
		<layer id="81" name="/decoders.0/self_attn/linear_q/Add/fq_output_0" type="FakeQuantize" version="opset1">
			<data levels="256" auto_broadcast="numpy" />
			<input>
				<port id="0" precision="FP32">
					<dim>-1</dim>
					<dim>-1</dim>
					<dim>768</dim>
				</port>
				<port id="1" precision="FP32" />
				<port id="2" precision="FP32" />
				<port id="3" precision="FP32" />
				<port id="4" precision="FP32" />
			</input>
			<output>
				<port id="5" precision="FP32">
					<dim>-1</dim>
					<dim>-1</dim>
					<dim>768</dim>
				</port>
			</output>
		</layer>
		<layer id="82" name="/decoders.0/self_attn/Shape" type="ShapeOf" version="opset3">
			<data output_type="i64" />
			<input>
				<port id="0" precision="FP32">
					<dim>-1</dim>
					<dim>-1</dim>
					<dim>768</dim>
				</port>
			</input>
			<output>
				<port id="1" precision="I64" names="/decoders.0/self_attn/Shape_output_0">
					<dim>3</dim>
				</port>
			</output>
		</layer>
		<layer id="83" name="Constant_44200" type="Const" version="opset1">
			<data element_type="i64" shape="1" offset="3897828" size="8" />
			<rt_info>
				<attribute name="precise" version="0" />
			</rt_info>
			<output>
				<port id="0" precision="I64">
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="84" name="Constant_41528" type="Const" version="opset1">
			<data element_type="i64" shape="" offset="3897828" size="8" />
			<rt_info>
				<attribute name="precise" version="0" />
			</rt_info>
			<output>
				<port id="0" precision="I64" />
			</output>
		</layer>
		<layer id="85" name="/decoders.0/self_attn/Gather" type="Gather" version="opset8">
			<data batch_dims="0" />
			<input>
				<port id="0" precision="I64">
					<dim>3</dim>
				</port>
				<port id="1" precision="I64">
					<dim>1</dim>
				</port>
				<port id="2" precision="I64" />
			</input>
			<output>
				<port id="3" precision="I64" names="/decoders.0/self_attn/Gather_output_0,/decoders.0/self_attn/Unsqueeze_1_output_0,/decoders.0/self_attn/Unsqueeze_2_output_0,/decoders.0/self_attn/Unsqueeze_output_0">
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="86" name="/decoders.0/self_attn/Constant_1" type="Const" version="opset1">
			<data element_type="i64" shape="1" offset="11580992" size="8" />
			<rt_info>
				<attribute name="precise" version="0" />
			</rt_info>
			<output>
				<port id="0" precision="I64" names="/decoders.0/self_attn/Constant_1_output_0">
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="87" name="/decoders.0/self_attn/Constant_2" type="Const" version="opset1">
			<data element_type="i64" shape="1" offset="12180056" size="8" />
			<rt_info>
				<attribute name="precise" version="0" />
			</rt_info>
			<output>
				<port id="0" precision="I64" names="/decoders.0/self_attn/Constant_2_output_0">
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="88" name="/decoders.0/self_attn/Constant_3" type="Const" version="opset1">
			<data element_type="i64" shape="1" offset="12180064" size="8" />
			<rt_info>
				<attribute name="precise" version="0" />
			</rt_info>
			<output>
				<port id="0" precision="I64" names="/decoders.0/self_attn/Constant_3_output_0">
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="89" name="/decoders.0/self_attn/Concat" type="Concat" version="opset1">
			<data axis="0" />
			<input>
				<port id="0" precision="I64">
					<dim>1</dim>
				</port>
				<port id="1" precision="I64">
					<dim>1</dim>
				</port>
				<port id="2" precision="I64">
					<dim>1</dim>
				</port>
				<port id="3" precision="I64">
					<dim>1</dim>
				</port>
			</input>
			<output>
				<port id="4" precision="I64" names="/decoders.0/self_attn/Concat_1_output_0,/decoders.0/self_attn/Concat_2_output_0,/decoders.0/self_attn/Concat_output_0">
					<dim>4</dim>
				</port>
			</output>
		</layer>
		<layer id="90" name="/decoders.0/self_attn/Reshape" type="Reshape" version="opset1">
			<data special_zero="true" />
			<input>
				<port id="0" precision="FP32">
					<dim>-1</dim>
					<dim>-1</dim>
					<dim>768</dim>
				</port>
				<port id="1" precision="I64">
					<dim>4</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP32" names="/decoders.0/self_attn/Reshape_output_0">
					<dim>-1</dim>
					<dim>-1</dim>
					<dim>12</dim>
					<dim>64</dim>
				</port>
			</output>
		</layer>
		<layer id="91" name="Constant_41560" type="Const" version="opset1">
			<data element_type="i64" shape="4" offset="12180072" size="32" />
			<output>
				<port id="0" precision="I64">
					<dim>4</dim>
				</port>
			</output>
		</layer>
		<layer id="92" name="/decoders.0/self_attn/Transpose" type="Transpose" version="opset1">
			<input>
				<port id="0" precision="FP32">
					<dim>-1</dim>
					<dim>-1</dim>
					<dim>12</dim>
					<dim>64</dim>
				</port>
				<port id="1" precision="I64">
					<dim>4</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP32" names="/decoders.0/self_attn/Transpose_output_0">
					<dim>-1</dim>
					<dim>12</dim>
					<dim>-1</dim>
					<dim>64</dim>
				</port>
			</output>
		</layer>
		<layer id="93" name="Constant_45622_compressed" type="Const" version="opset1">
			<data element_type="f16" shape="1, 1, 768" offset="12180104" size="1536" />
			<output>
				<port id="0" precision="FP16">
					<dim>1</dim>
					<dim>1</dim>
					<dim>768</dim>
				</port>
			</output>
		</layer>
		<layer id="94" name="Constant_45622" type="Convert" version="opset1">
			<data destination_type="f32" />
			<rt_info>
				<attribute name="decompression" version="0" />
			</rt_info>
			<input>
				<port id="0" precision="FP16">
					<dim>1</dim>
					<dim>1</dim>
					<dim>768</dim>
				</port>
			</input>
			<output>
				<port id="1" precision="FP32">
					<dim>1</dim>
					<dim>1</dim>
					<dim>768</dim>
				</port>
			</output>
		</layer>
		<layer id="95" name="/decoders.0/norm1/Add_1_0_0/nncf_smooth_quant/scale" type="Const" version="opset1">
			<data element_type="f32" shape="1, 1, 768" offset="12181640" size="3072" />
			<output>
				<port id="0" precision="FP32">
					<dim>1</dim>
					<dim>1</dim>
					<dim>768</dim>
				</port>
			</output>
		</layer>
		<layer id="96" name="/decoders.0/norm1/Add_1_0_0/nncf_smooth_quant" type="Multiply" version="opset1">
			<data auto_broadcast="numpy" />
			<input>
				<port id="0" precision="FP32">
					<dim>-1</dim>
					<dim>-1</dim>
					<dim>768</dim>
				</port>
				<port id="1" precision="FP32">
					<dim>1</dim>
					<dim>1</dim>
					<dim>768</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP32">
					<dim>-1</dim>
					<dim>-1</dim>
					<dim>768</dim>
				</port>
			</output>
		</layer>
		<layer id="97" name="/decoders.0/norm1/Add_1_0_0/nncf_smooth_quant/fq_output_0/input_low" type="Const" version="opset1">
			<data element_type="f32" shape="" offset="12184712" size="4" />
			<output>
				<port id="0" precision="FP32" />
			</output>
		</layer>
		<layer id="98" name="/decoders.0/norm1/Add_1_0_0/nncf_smooth_quant/fq_output_0/input_high" type="Const" version="opset1">
			<data element_type="f32" shape="" offset="12184716" size="4" />
			<output>
				<port id="0" precision="FP32" />
			</output>
		</layer>
		<layer id="99" name="/decoders.0/norm1/Add_1_0_0/nncf_smooth_quant/fq_output_0/output_low" type="Const" version="opset1">
			<data element_type="f32" shape="" offset="12184712" size="4" />
			<output>
				<port id="0" precision="FP32" />
			</output>
		</layer>
		<layer id="100" name="/decoders.0/norm1/Add_1_0_0/nncf_smooth_quant/fq_output_0/output_high" type="Const" version="opset1">
			<data element_type="f32" shape="" offset="12184716" size="4" />
			<output>
				<port id="0" precision="FP32" />
			</output>
		</layer>
		<layer id="101" name="/decoders.0/norm1/Add_1_0_0/nncf_smooth_quant/fq_output_0" type="FakeQuantize" version="opset1">
			<data levels="256" auto_broadcast="numpy" />
			<input>
				<port id="0" precision="FP32">
					<dim>-1</dim>
					<dim>-1</dim>
					<dim>768</dim>
				</port>
				<port id="1" precision="FP32" />
				<port id="2" precision="FP32" />
				<port id="3" precision="FP32" />
				<port id="4" precision="FP32" />
			</input>
			<output>
				<port id="5" precision="FP32">
					<dim>-1</dim>
					<dim>-1</dim>
					<dim>768</dim>
				</port>
			</output>
		</layer>
		<layer id="102" name="Constant_1468737" type="Const" version="opset1">
			<data element_type="i8" shape="768, 768" offset="12184720" size="589824" />
			<output>
				<port id="0" precision="I8">
					<dim>768</dim>
					<dim>768</dim>
				</port>
			</output>
		</layer>
		<layer id="103" name="Convert_1468738" type="Convert" version="opset1">
			<data destination_type="f32" />
			<input>
				<port id="0" precision="I8">
					<dim>768</dim>
					<dim>768</dim>
				</port>
			</input>
			<output>
				<port id="1" precision="FP32">
					<dim>768</dim>
					<dim>768</dim>
				</port>
			</output>
		</layer>
		<layer id="104" name="Constant_1468739" type="Const" version="opset1">
			<data element_type="f32" shape="768, 1" offset="12774544" size="3072" />
			<output>
				<port id="0" precision="FP32">
					<dim>768</dim>
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="105" name="/decoders.0/self_attn/linear_k/MatMul/fq_weights_1" type="Multiply" version="opset1">
			<data auto_broadcast="numpy" />
			<input>
				<port id="0" precision="FP32">
					<dim>768</dim>
					<dim>768</dim>
				</port>
				<port id="1" precision="FP32">
					<dim>768</dim>
					<dim>1</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP32">
					<dim>768</dim>
					<dim>768</dim>
				</port>
			</output>
		</layer>
		<layer id="106" name="/decoders.0/self_attn/linear_k/MatMul" type="MatMul" version="opset1">
			<data transpose_a="false" transpose_b="true" />
			<input>
				<port id="0" precision="FP32">
					<dim>-1</dim>
					<dim>-1</dim>
					<dim>768</dim>
				</port>
				<port id="1" precision="FP32">
					<dim>768</dim>
					<dim>768</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP32" names="/decoders.0/self_attn/linear_k/MatMul_output_0">
					<dim>-1</dim>
					<dim>-1</dim>
					<dim>768</dim>
				</port>
			</output>
		</layer>
		<layer id="107" name="/decoders.0/self_attn/linear_k/Add" type="Add" version="opset1">
			<data auto_broadcast="numpy" />
			<input>
				<port id="0" precision="FP32">
					<dim>1</dim>
					<dim>1</dim>
					<dim>768</dim>
				</port>
				<port id="1" precision="FP32">
					<dim>-1</dim>
					<dim>-1</dim>
					<dim>768</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP32" names="/decoders.0/self_attn/linear_k/Add_output_0">
					<dim>-1</dim>
					<dim>-1</dim>
					<dim>768</dim>
				</port>
			</output>
		</layer>
		<layer id="108" name="/decoders.0/self_attn/Reshape_1" type="Reshape" version="opset1">
			<data special_zero="true" />
			<input>
				<port id="0" precision="FP32">
					<dim>-1</dim>
					<dim>-1</dim>
					<dim>768</dim>
				</port>
				<port id="1" precision="I64">
					<dim>4</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP32" names="/decoders.0/self_attn/Reshape_1_output_0">
					<dim>-1</dim>
					<dim>-1</dim>
					<dim>12</dim>
					<dim>64</dim>
				</port>
			</output>
		</layer>
		<layer id="109" name="Constant_41564" type="Const" version="opset1">
			<data element_type="i64" shape="4" offset="12777616" size="32" />
			<output>
				<port id="0" precision="I64">
					<dim>4</dim>
				</port>
			</output>
		</layer>
		<layer id="110" name="/decoders.0/self_attn/Transpose_2" type="Transpose" version="opset1">
			<input>
				<port id="0" precision="FP32">
					<dim>-1</dim>
					<dim>-1</dim>
					<dim>12</dim>
					<dim>64</dim>
				</port>
				<port id="1" precision="I64">
					<dim>4</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP32" names="/decoders.0/self_attn/Transpose_2_output_0">
					<dim>-1</dim>
					<dim>12</dim>
					<dim>64</dim>
					<dim>-1</dim>
				</port>
			</output>
		</layer>
		<layer id="111" name="Constant_45623_compressed" type="Const" version="opset1">
			<data element_type="f16" shape="1, 1, 1, 1" offset="12777648" size="2" />
			<output>
				<port id="0" precision="FP16">
					<dim>1</dim>
					<dim>1</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="112" name="Constant_45623" type="Convert" version="opset1">
			<data destination_type="f32" />
			<rt_info>
				<attribute name="decompression" version="0" />
			</rt_info>
			<input>
				<port id="0" precision="FP16">
					<dim>1</dim>
					<dim>1</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</input>
			<output>
				<port id="1" precision="FP32">
					<dim>1</dim>
					<dim>1</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="113" name="Multiply_45342" type="Multiply" version="opset1">
			<data auto_broadcast="numpy" />
			<input>
				<port id="0" precision="FP32">
					<dim>-1</dim>
					<dim>12</dim>
					<dim>64</dim>
					<dim>-1</dim>
				</port>
				<port id="1" precision="FP32">
					<dim>1</dim>
					<dim>1</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP32">
					<dim>-1</dim>
					<dim>12</dim>
					<dim>64</dim>
					<dim>-1</dim>
				</port>
			</output>
		</layer>
		<layer id="114" name="Multiply_45342/fq_output_0/input_low" type="Const" version="opset1">
			<data element_type="f32" shape="" offset="12777650" size="4" />
			<output>
				<port id="0" precision="FP32" />
			</output>
		</layer>
		<layer id="115" name="Multiply_45342/fq_output_0/input_high" type="Const" version="opset1">
			<data element_type="f32" shape="" offset="12777654" size="4" />
			<output>
				<port id="0" precision="FP32" />
			</output>
		</layer>
		<layer id="116" name="Multiply_45342/fq_output_0/output_low" type="Const" version="opset1">
			<data element_type="f32" shape="" offset="12777650" size="4" />
			<output>
				<port id="0" precision="FP32" />
			</output>
		</layer>
		<layer id="117" name="Multiply_45342/fq_output_0/output_high" type="Const" version="opset1">
			<data element_type="f32" shape="" offset="12777654" size="4" />
			<output>
				<port id="0" precision="FP32" />
			</output>
		</layer>
		<layer id="118" name="Multiply_45342/fq_output_0" type="FakeQuantize" version="opset1">
			<data levels="256" auto_broadcast="numpy" />
			<input>
				<port id="0" precision="FP32">
					<dim>-1</dim>
					<dim>12</dim>
					<dim>64</dim>
					<dim>-1</dim>
				</port>
				<port id="1" precision="FP32" />
				<port id="2" precision="FP32" />
				<port id="3" precision="FP32" />
				<port id="4" precision="FP32" />
			</input>
			<output>
				<port id="5" precision="FP32">
					<dim>-1</dim>
					<dim>12</dim>
					<dim>64</dim>
					<dim>-1</dim>
				</port>
			</output>
		</layer>
		<layer id="119" name="/decoders.0/self_attn/Div" type="MatMul" version="opset1">
			<data transpose_a="false" transpose_b="false" />
			<input>
				<port id="0" precision="FP32">
					<dim>-1</dim>
					<dim>12</dim>
					<dim>-1</dim>
					<dim>64</dim>
				</port>
				<port id="1" precision="FP32">
					<dim>-1</dim>
					<dim>12</dim>
					<dim>64</dim>
					<dim>-1</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP32" names="/decoders.0/self_attn/Div_output_0">
					<dim>-1</dim>
					<dim>12</dim>
					<dim>-1</dim>
					<dim>-1</dim>
				</port>
			</output>
		</layer>
		<layer id="120" name="/decoders.0/self_attn/Where" type="Select" version="opset1">
			<data auto_broadcast="numpy" />
			<input>
				<port id="0" precision="BOOL">
					<dim>-1</dim>
					<dim>1</dim>
					<dim>-1</dim>
					<dim>-1</dim>
				</port>
				<port id="1" precision="FP32" />
				<port id="2" precision="FP32">
					<dim>-1</dim>
					<dim>12</dim>
					<dim>-1</dim>
					<dim>-1</dim>
				</port>
			</input>
			<output>
				<port id="3" precision="FP32" names="/decoders.0/self_attn/Where_output_0">
					<dim>-1</dim>
					<dim>12</dim>
					<dim>-1</dim>
					<dim>-1</dim>
				</port>
			</output>
		</layer>
		<layer id="121" name="/decoders.0/self_attn/Softmax" type="SoftMax" version="opset8">
			<data axis="3" />
			<input>
				<port id="0" precision="FP32">
					<dim>-1</dim>
					<dim>12</dim>
					<dim>-1</dim>
					<dim>-1</dim>
				</port>
			</input>
			<output>
				<port id="1" precision="FP32" names="/decoders.0/self_attn/Softmax_output_0">
					<dim>-1</dim>
					<dim>12</dim>
					<dim>-1</dim>
					<dim>-1</dim>
				</port>
			</output>
		</layer>
		<layer id="122" name="/decoders.0/self_attn/Where_1" type="Select" version="opset1">
			<data auto_broadcast="numpy" />
			<input>
				<port id="0" precision="BOOL">
					<dim>-1</dim>
					<dim>1</dim>
					<dim>-1</dim>
					<dim>-1</dim>
				</port>
				<port id="1" precision="FP32" />
				<port id="2" precision="FP32">
					<dim>-1</dim>
					<dim>12</dim>
					<dim>-1</dim>
					<dim>-1</dim>
				</port>
			</input>
			<output>
				<port id="3" precision="FP32" names="/decoders.0/self_attn/Where_1_output_0">
					<dim>-1</dim>
					<dim>12</dim>
					<dim>-1</dim>
					<dim>-1</dim>
				</port>
			</output>
		</layer>
		<layer id="123" name="/decoders.0/self_attn/Where_1/fq_output_0/input_low" type="Const" version="opset1">
			<data element_type="f32" shape="" offset="11577862" size="4" />
			<output>
				<port id="0" precision="FP32" />
			</output>
		</layer>
		<layer id="124" name="/decoders.0/self_attn/Where_1/fq_output_0/input_high" type="Const" version="opset1">
			<data element_type="f32" shape="" offset="12777658" size="4" />
			<output>
				<port id="0" precision="FP32" />
			</output>
		</layer>
		<layer id="125" name="/decoders.0/self_attn/Where_1/fq_output_0/output_low" type="Const" version="opset1">
			<data element_type="f32" shape="" offset="11577862" size="4" />
			<output>
				<port id="0" precision="FP32" />
			</output>
		</layer>
		<layer id="126" name="/decoders.0/self_attn/Where_1/fq_output_0/output_high" type="Const" version="opset1">
			<data element_type="f32" shape="" offset="12777658" size="4" />
			<output>
				<port id="0" precision="FP32" />
			</output>
		</layer>
		<layer id="127" name="/decoders.0/self_attn/Where_1/fq_output_0" type="FakeQuantize" version="opset1">
			<data levels="256" auto_broadcast="numpy" />
			<input>
				<port id="0" precision="FP32">
					<dim>-1</dim>
					<dim>12</dim>
					<dim>-1</dim>
					<dim>-1</dim>
				</port>
				<port id="1" precision="FP32" />
				<port id="2" precision="FP32" />
				<port id="3" precision="FP32" />
				<port id="4" precision="FP32" />
			</input>
			<output>
				<port id="5" precision="FP32">
					<dim>-1</dim>
					<dim>12</dim>
					<dim>-1</dim>
					<dim>-1</dim>
				</port>
			</output>
		</layer>
		<layer id="128" name="Constant_45624_compressed" type="Const" version="opset1">
			<data element_type="f16" shape="1, 1, 768" offset="12777662" size="1536" />
			<output>
				<port id="0" precision="FP16">
					<dim>1</dim>
					<dim>1</dim>
					<dim>768</dim>
				</port>
			</output>
		</layer>
		<layer id="129" name="Constant_45624" type="Convert" version="opset1">
			<data destination_type="f32" />
			<rt_info>
				<attribute name="decompression" version="0" />
			</rt_info>
			<input>
				<port id="0" precision="FP16">
					<dim>1</dim>
					<dim>1</dim>
					<dim>768</dim>
				</port>
			</input>
			<output>
				<port id="1" precision="FP32">
					<dim>1</dim>
					<dim>1</dim>
					<dim>768</dim>
				</port>
			</output>
		</layer>
